/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50621
Source Host           : localhost:3306
Source Database       : monitor

Target Server Type    : MYSQL
Target Server Version : 50621
File Encoding         : 65001

Date: 2015-09-26 19:58:51
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `monitor_duty_info`
-- ----------------------------
DROP TABLE IF EXISTS `monitor_duty_info`;
CREATE TABLE `monitor_duty_info` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `data` varchar(20) DEFAULT NULL,
  `num` varchar(10) DEFAULT NULL,
  `train` varchar(10) DEFAULT NULL,
  `t0` varchar(10) DEFAULT NULL,
  `m0` varchar(10) DEFAULT NULL,
  `m1` varchar(10) DEFAULT NULL,
  `m2` varchar(10) DEFAULT NULL,
  `t1` varchar(10) DEFAULT NULL,
  `t2` varchar(10) DEFAULT NULL,
  `rem0` varchar(200) DEFAULT NULL,
  `dir` varchar(10) DEFAULT NULL,
  `way` varchar(10) DEFAULT NULL,
  `sou` varchar(10) DEFAULT NULL,
  `t3` varchar(10) DEFAULT NULL,
  `t4` varchar(10) DEFAULT NULL,
  `rem1` varchar(200) DEFAULT NULL,
  `deviceid` varchar(20) DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of monitor_duty_info
-- ----------------------------
INSERT INTO `monitor_duty_info` VALUES ('51', '2015-09-21', '7890', '客  车  车  车', '13:20', '999', '888', '777', '13:20', '13:20', '正  常', null, '手动', null, null, null, null, '010301005009035', '2015-09-22 08:44:21', '2015-09-22 08:44:21');
INSERT INTO `monitor_duty_info` VALUES ('52', '2015-09-21', '7890', '客  车  车  车', '13:20', '999', '888', '777', '13:20', '13:20', '正  常', null, '手动', null, null, null, null, '010301005009035', '2015-09-22 08:44:28', '2015-09-22 08:44:28');
INSERT INTO `monitor_duty_info` VALUES ('53', '2015-09-21', '7890', ' 客  车 ', '13:20', '999', '888', '777', '13:20', '13:20', null, null, null, null, null, null, null, '010301005009035', '2015-09-22 09:09:33', '2015-09-22 09:09:33');
INSERT INTO `monitor_duty_info` VALUES ('54', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', null, null, '手动', null, null, null, null, '010301005009035', '2015-09-22 09:10:14', '2015-09-22 09:10:14');
INSERT INTO `monitor_duty_info` VALUES ('55', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', null, null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:11:19', '2015-09-22 09:11:19');
INSERT INTO `monitor_duty_info` VALUES ('56', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '正 常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:11:55', '2015-09-22 09:11:55');
INSERT INTO `monitor_duty_info` VALUES ('57', '2015-09-21', '7890', '客 车', '13:20', '999', '888', '777', '13:20', '13:20', null, null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:36:46', '2015-09-22 09:36:46');
INSERT INTO `monitor_duty_info` VALUES ('58', '2015-09-21', '7890', '客 车', '13:20', '999', '888', '777', '13:20', '13:20', '非  正  常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:53:33', '2015-09-22 09:53:33');
INSERT INTO `monitor_duty_info` VALUES ('59', '2015-09-21', '7890', '客 车', '13:20', '999', '888', '777', '13:20', '13:20', '非  正  常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:53:42', '2015-09-22 09:53:42');
INSERT INTO `monitor_duty_info` VALUES ('60', '2015-09-21', '7890', '客 车', '13:20', '999', '888', '777', '13:20', '13:20', '非  正  常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:54:17', '2015-09-22 09:54:17');
INSERT INTO `monitor_duty_info` VALUES ('61', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '非  正  常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:55:08', '2015-09-22 09:55:08');
INSERT INTO `monitor_duty_info` VALUES ('62', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '非   正   常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 09:57:15', '2015-09-22 09:57:15');
INSERT INTO `monitor_duty_info` VALUES ('63', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '非 非 正 常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 10:08:02', '2015-09-22 10:08:02');
INSERT INTO `monitor_duty_info` VALUES ('64', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '非  非  正  常', null, '手 动', null, null, null, null, '010301005009035', '2015-09-22 10:08:20', '2015-09-22 10:08:20');
INSERT INTO `monitor_duty_info` VALUES ('65', '2015-09-21', '7890', '客  车', '13:20', '999', '888', '777', '13:20', '13:20', '非  正  常', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 10:31:50', '2015-09-22 10:31:50');
INSERT INTO `monitor_duty_info` VALUES ('66', '2015-09-22', '1234', '调  车', '10:39', '22', '11', '', '10:39', '10:39', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 10:55:33', '2015-09-22 10:55:33');
INSERT INTO `monitor_duty_info` VALUES ('67', '2015-09-22', '1234', '客  车', '11:00', '111', '222', '333', '11:00', '11:00', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:00:45', '2015-09-22 11:00:45');
INSERT INTO `monitor_duty_info` VALUES ('68', '2015-09-22', '7890', 'N', '', '', '', '', '', '', '是', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:05:58', '2015-09-22 11:05:58');
INSERT INTO `monitor_duty_info` VALUES ('69', '2015-09-22', '7890', '客  车', '11:40', '111', '222', '333', '11:40', '11:40', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:38:31', '2015-09-22 11:38:31');
INSERT INTO `monitor_duty_info` VALUES ('70', '2015-09-22', '7890', '货  车', '11:40', '111', '222', '333', '11:40', '11:40', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:39:15', '2015-09-22 11:39:15');
INSERT INTO `monitor_duty_info` VALUES ('71', '2015-09-22', '7890', '调  车', '11:40', '111', '222', '333', '11:40', '11:40', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:39:58', '2015-09-22 11:39:58');
INSERT INTO `monitor_duty_info` VALUES ('72', '2015-09-22', '7890', 'DZ12', '11:40', '111', '222', '333', '11:40', '11:40', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 11:40:43', '2015-09-22 11:40:43');
INSERT INTO `monitor_duty_info` VALUES ('73', '2015-09-22', '4567', 'D123', '12:15', '123', '123', '123', '12:15', '12:15', '是', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 12:12:15', '2015-09-22 12:12:15');
INSERT INTO `monitor_duty_info` VALUES ('74', '2015-09-22', '4567', '货  车', '', '', '', '', '', '', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-22 16:09:50', '2015-09-22 16:09:50');
INSERT INTO `monitor_duty_info` VALUES ('75', '2015-09-24', '0006', 'KLL', '13:30', '1', '33', '', '13:30', '13:30', '否', null, '手  动', null, null, null, null, '010301005009035', '2015-09-24 13:32:14', '2015-09-24 13:32:14');
INSERT INTO `monitor_duty_info` VALUES ('76', '2015-09-24', '0006', '客  车', '15:19', '111', '222', '', '15:19', '15:19', '是', null, '手  动', null, '000007 S', null, null, '010301005009035', '2015-09-24 15:21:26', '2015-09-24 15:21:26');
INSERT INTO `monitor_duty_info` VALUES ('77', '2015-09-24', '0006', '', '', '', '', '', '', '15:34', '否', null, '手  动', null, '000007 S', null, null, '010301005009035', '2015-09-25 15:10:10', '2015-09-25 15:10:10');
INSERT INTO `monitor_duty_info` VALUES ('78', '2015-09-25', '0006', '', '', '', '', '', '', '15:04', '否', null, '手  动', null, '000008 S', null, null, '010301005009035', '2015-09-25 15:11:13', '2015-09-25 15:11:13');
INSERT INTO `monitor_duty_info` VALUES ('79', '2015-09-25', '0006', '', '', '', '', '', '', '15:06', '否', null, '手  动', null, '000009 S', null, null, '010301005009035', '2015-09-25 15:11:59', '2015-09-25 15:11:59');
INSERT INTO `monitor_duty_info` VALUES ('80', '2015-09-25', '0008', '', '', '', '', '', '', '15:57', '否', null, '自  动', null, '000007 S', null, null, '010301005009035', '2015-09-25 15:59:26', '2015-09-25 15:59:26');
INSERT INTO `monitor_duty_info` VALUES ('81', '2015-09-25', '0008', '', '', '', '', '', '', '15:13', '否', null, '手  动', null, '000010 S', null, null, '010301005009035', '2015-09-25 16:03:22', '2015-09-25 16:03:22');
INSERT INTO `monitor_duty_info` VALUES ('82', '2015-09-25', '0008', '', '', '', '', '', '', '15:30', '否', null, '手  动', null, '000008 S', null, null, '010301005009035', '2015-09-25 16:03:54', '2015-09-25 16:03:54');
INSERT INTO `monitor_duty_info` VALUES ('83', '2015-09-25', '0008', '', '', '', '', '', '', '15:52', '否', null, '手  动', null, '000007 S', null, null, '010301005009035', '2015-09-25 16:04:22', '2015-09-25 16:04:22');
INSERT INTO `monitor_duty_info` VALUES ('84', '2015-09-25', '0008', '', '', '', '', '', '', '15:53', '否', null, '手  动', null, '000007 S', null, null, '010301005009035', '2015-09-25 16:04:54', '2015-09-25 16:04:54');
INSERT INTO `monitor_duty_info` VALUES ('85', '2015-09-25', '0008', '', '', '', '', '', '', '16:01', '否', null, '手  动', null, '000009 S', null, null, '010301005009035', '2015-09-25 16:05:26', '2015-09-25 16:05:26');
INSERT INTO `monitor_duty_info` VALUES ('86', '2015-09-25', '0008', '', '', '', '', '', '', '16:03', '否', null, '手  动', null, '000010 S', null, null, '010301005009035', '2015-09-25 16:12:47', '2015-09-25 16:12:47');
INSERT INTO `monitor_duty_info` VALUES ('87', '2015-09-25', '0008', '', '', '', '', '', '', '16:10', '否', null, '手  动', null, '000009 S', null, null, '010301005009035', '2015-09-25 16:13:19', '2015-09-25 16:13:19');
INSERT INTO `monitor_duty_info` VALUES ('88', '2015-09-25', '0008', '', '', '', '', '', '', '16:12', '否', null, '手  动', null, '000007 S', null, null, '010301005009035', '2015-09-25 16:16:29', '2015-09-25 16:16:29');
INSERT INTO `monitor_duty_info` VALUES ('89', '2015-09-25', '0008', '', '', '', '', '', '', '16:13', '否', null, '手  动', null, '000006 S', null, null, '010301005009035', '2015-09-25 16:17:01', '2015-09-25 16:17:01');
INSERT INTO `monitor_duty_info` VALUES ('90', '2015-09-25', '0008', '', '', '', '', '', '', '16:13', '否', null, '手  动', null, '000006 S', null, null, '010301005009035', '2015-09-25 16:20:45', '2015-09-25 16:20:45');
INSERT INTO `monitor_duty_info` VALUES ('91', '2015-09-25', '0008', '', '', '', '', '', '', '16:15', '否', null, '手  动', null, '000006 S', null, null, '010301005009035', '2015-09-25 16:21:16', '2015-09-25 16:21:16');
INSERT INTO `monitor_duty_info` VALUES ('92', '2015-09-26', '0008', '货  车', '10:09', '1', '1', '', '10:08', '10:08', '是', null, '手  动', null, null, null, null, '010301005009035', '2015-09-26 10:11:01', '2015-09-26 10:11:01');
INSERT INTO `monitor_duty_info` VALUES ('93', '2015-09-24', '6789', '调  车', '', '', '', '', '', '15:22', '是', null, '手  动', null, '000007 S', null, null, '010301005009036', '2015-09-26 10:22:00', '2015-09-26 10:22:00');
INSERT INTO `monitor_duty_info` VALUES ('94', '2015-09-26', '0008', 'D1234', '', '', '', '', '', '', '%ca%c7', null, '%ca%d6%20%', null, null, null, null, '020103008004783', '2015-09-26 15:22:15', '2015-09-26 15:22:15');
INSERT INTO `monitor_duty_info` VALUES ('95', '2015-09-26', '0008', '12345', '15:20', '123', '456', '', '15:21', '15:21', '是', null, '手  动', null, null, null, null, '020103008004783', '2015-09-26 15:22:57', '2015-09-26 15:22:57');
INSERT INTO `monitor_duty_info` VALUES ('96', '2015-09-26', '0008', '货  车', '16:26', '131', '123', '', '16:26', '16:26', '否', null, '手  动', null, '000006 S', null, null, '020103008004783', '2015-09-26 16:28:17', '2015-09-26 16:28:17');
INSERT INTO `monitor_duty_info` VALUES ('97', '2015-09-26', '0008', '客  车', '16:28', '111', '221', '', '16:28', '16:30', '是', null, '手  动', null, '000007 S', null, null, '010303008004783', '2015-09-26 16:32:21', '2015-09-26 16:32:21');
INSERT INTO `monitor_duty_info` VALUES ('98', '2015-09-26', '0008', '客  车', '16:34', '111', '2', '', '16:34', '16:34', '是', '上  行  来  车', '手  动', null, '000007 S', '15-09-26 1', null, '010303008004783', '2015-09-26 16:36:02', '2015-09-26 16:36:02');
INSERT INTO `monitor_duty_info` VALUES ('99', '2015-09-26', '0008', '122', '16:37', '123', '32', '', '16:37', '16:37', '是', '上  行  来  车', '手  动', null, '000008 S', '15-09-26 1', null, '010303008004783', '2015-09-26 16:39:12', '2015-09-26 16:39:12');
INSERT INTO `monitor_duty_info` VALUES ('100', '2015-09-26', '0123', '调  车', '18:02', '222', '111', '222', '18:02', '18:02', '是', '未  知  线', '手  动', null, null, null, null, '010301005009036', '2015-09-26 17:59:14', '2015-09-26 17:59:14');
INSERT INTO `monitor_duty_info` VALUES ('101', '2015-09-26', '7890', '客  车', '19:14', '1', '', '', '19:14', '19:14', '是', '未  知  线', '手  动', null, null, null, null, '010301005009036', '2015-09-26 19:11:28', '2015-09-26 19:11:28');
